<?php
namespace App\Services;

class DictionaryService
{
    public const ENGINE_TYPES = [
        'GASOLINE' => ['name' => 'Бензин', 'auto_parser_name' => 'бензин'],
        'DIESEL' => ['name' => 'Дизель', 'auto_parser_name' => 'дизель'],
        'HYBRID' => ['name' => 'Гибрид', 'auto_parser_name' => 'гибрид'],
        'ELECTRO' => ['name' => 'Электро', 'auto_parser_name' => 'электро'],
        'LPG' => ['name' => 'ГБО', 'auto_parser_name' => 'газ'],
    ];

    // "prep_engine_type":["бензин","газ","гибрид","дизель","электро"],

    public const GEAR_TYPES = [
        'FORWARD_CONTROL' => ['name' => 'Передний', 'auto_parser_name' => 'передний'],
        'REAR_DRIVE' => ['name' => 'Задний', 'auto_parser_name' => 'задний'],
        'ALL_WHEEL_DRIVE' => ['name' => 'Полный', 'auto_parser_name' => 'полный'],
    ];

    // "prep_drive_type":["задний","передний","полный"]


    public const TRANSMISSIONS = [
        'MECHANICAL' => ['name' => 'Механическая', 'auto_parser_name' => 'механика'],
        'AUTOMATIC' => ['name' => 'Автоматическая', 'auto_parser_name' => 'автомат'],
        'ROBOT' => ['name' => 'Робот', 'auto_parser_name' => 'робот'],
        'VARIATOR' => ['name' => 'Вариатор', 'auto_parser_name' => 'вариатор'],
    ];
    // "prep_transmission":["автомат","вариатор","механика","робот"],

    public const STEERING_WHEELS = [
        'LEFT' => ['name' => 'Слева'],
        'RIGHT' => ['name' => 'Справа'],
    ];

    public const BODY_TYPES = [
        'Седан' => [
            'auto_parser_name' => 'седан',
        ],
        'Хэтчбек' => [
            'auto_parser_name' => 'хэтчбек 4 дв.',
        ],
        'Хэтчбек 3 дв.' => [
            'auto_parser_name' => 'трехдверный хэтчбэк',
        ],
        'Хэтчбек 5 дв.' => [
            'auto_parser_name' => 'пятидверный хэтчбэк',
        ],
        'Лифтбек' => [
            'auto_parser_name' => 'лифтбек',
        ],
        'Внедорожники' => [
            'auto_parser_name' => 'внедорожник открытый',
        ],
        'Внедорожник 3 дв.' => [
            'auto_parser_name' => 'трехдверный внедорожник',
        ],
        'Внедорожник 5 дв.' => [
            'auto_parser_name' => 'пятидверный внедорожник',
        ],
        'Универсал' => [
            'auto_parser_name' => 'универсал',
        ],
        'Купе' => [
            'auto_parser_name' => 'купе',
        ],
        'Минивэн' => [
            'auto_parser_name' => 'минивэн',
        ],
        'Пикап' => [
            'auto_parser_name' => 'пикап',
        ],
        'Лимузин' => [
            'auto_parser_name' => 'лимузин',
        ],
        'Фургон' => [
            'auto_parser_name' => 'фургон',
        ],
        'Кабриолет' => [
            'auto_parser_name' => 'кабриолет',
        ],
    ];

    public const REGIONS = [
        "Алтайский край",
        "Амурская область",
        "Архангельская область",
        "Астраханская область",
        "Белгородская область",
        "Брянская область",
        "Владимирская область",
        "Волгоградская область",
        "Вологодская область",
        "Воронежская область",
        "Еврейская автономная область",
        "Забайкальский край",
        "Ивановская область",
        "Иркутская область",
        "Кабардино-Балкарская Республика",
        "Калининградская область",
        "Калужская область",
        "Камчатский край",
        "Карачаево-Черкесская Республика",
        "Кемеровская область",
        "Кировская область",
        "Костромская область",
        "Краснодарский край",
        "Красноярский край",
        "Курганская область",
        "Курская область",
        "Липецкая область",
        "Магаданская область",
        "Москва и Московская область",
        "Мурманская область",
        "Ненецкий автономный округ",
        "Нижегородская область",
        "Новгородская область",
        "Новосибирская область",
        "Омская область",
        "Оренбургская область",
        "Орловская область",
        "Пензенская область",
        "Пермский край",
        "Приморский край",
        "Псковская область",
        "Республика Адыгея",
        "Республика Алтай",
        "Республика Башкортостан",
        "Республика Бурятия",
        "Республика Дагестан",
        "Республика Ингушетия",
        "Республика Калмыкия",
        "Республика Карелия",
        "Республика Коми",
        "Республика Крым",
        "Республика Марий Эл",
        "Республика Мордовия",
        "Республика Саха (Якутия)",
        "Республика Северная Осетия — Алания",
        "Республика Татарстан",
        "Республика Тыва",
        "Республика Хакасия",
        "Россия",
        "Ростовская область",
        "Рязанская область",
        "Самарская область",
        "Санкт-Петербург и Ленинградская область",
        "Саратовская область",
        "Сахалинская область",
        "Свердловская область",
        "Смоленская область",
        "Ставропольский край",
        "Тамбовская область",
        "Тверская область",
        "Томская область",
        "Тульская область",
        "Тюменская область",
        "Удмуртская Республика",
        "Ульяновская область",
        "Хабаровский край",
        "Ханты-Мансийский автономный округ - Югра",
        "Челябинская область",
        "Чеченская Республика",
        "Чувашская Республика",
        "Чукотский автономный округ",
        "Ямало-Ненецкий автономный округ",
        "Ярославская область"
    ];

    // public const REGIONS = '
    //     {"start":"21.08.2026 14:21:48","end":"21.08.2026 14:21:48","name":"region","method":"priceapi","error":false,"result":{"Regions":[{"RegionId":1,"RegionName":"Краснодарский край"},{"RegionId":2,"RegionName":"Тверская область"},{"RegionId":3,"RegionName":"Челябинская область"},{"RegionId":4,"RegionName":"Свердловская область"},{"RegionId":5,"RegionName":"Кемеровская область"},{"RegionId":6,"RegionName":"Ростовская область"},{"RegionId":7,"RegionName":"Ставропольский край"},{"RegionId":8,"RegionName":"Республика Адыгея"},{"RegionId":9,"RegionName":"Кабардино-Балкарская Республика"},{"RegionId":10,"RegionName":"Республика Карачаево-Черкессия"},{"RegionId":11,"RegionName":"Республика Северная Осетия - Алания"},{"RegionId":12,"RegionName":"Чеченская Республика"},{"RegionId":13,"RegionName":"Республика Ингушетия"},{"RegionId":14,"RegionName":"Смоленская область"},{"RegionId":15,"RegionName":"Воронежская область"},{"RegionId":16,"RegionName":"Саратовская область"},{"RegionId":17,"RegionName":"Пензенская область"},{"RegionId":18,"RegionName":"Республика Татарстан"},{"RegionId":19,"RegionName":"Республика Чувашия"},{"RegionId":20,"RegionName":"Хабаровский край"},{"RegionId":21,"RegionName":"Калининградская область"},{"RegionId":22,"RegionName":"Брянская область"},{"RegionId":23,"RegionName":"Курганская область"},{"RegionId":24,"RegionName":"Ханты - Мансийский АО"},{"RegionId":25,"RegionName":"Ямало-Ненецкий АО"},{"RegionId":26,"RegionName":"Магаданская область"},{"RegionId":27,"RegionName":"Еврейская автономная область"},{"RegionId":28,"RegionName":"Сахалинская область"},{"RegionId":29,"RegionName":"Камчатский край"},{"RegionId":30,"RegionName":"Чукотский АО"},{"RegionId":31,"RegionName":"Ульяновская область"},{"RegionId":32,"RegionName":"Республика Карелия"},{"RegionId":33,"RegionName":"Владимирская область"},{"RegionId":34,"RegionName":"Орловская область"},{"RegionId":35,"RegionName":"Тамбовская область"},{"RegionId":36,"RegionName":"Вологодская область"},{"RegionId":37,"RegionName":"Кировская область"},{"RegionId":38,"RegionName":"г. Москва"},{"RegionId":39,"RegionName":"Калужская область"},{"RegionId":40,"RegionName":"Липецкая область"},{"RegionId":41,"RegionName":"Рязанская область"},{"RegionId":42,"RegionName":"г. Санкт-Петербург и Ленинградская область"},{"RegionId":43,"RegionName":"Омская область"},{"RegionId":44,"RegionName":"Волгоградская область"},{"RegionId":45,"RegionName":"Томская область"},{"RegionId":46,"RegionName":"Иркутская область"},{"RegionId":47,"RegionName":"Самарская область"},{"RegionId":48,"RegionName":"Архангельская область"},{"RegionId":49,"RegionName":"Мурманская область"},{"RegionId":50,"RegionName":"Республика Коми"},{"RegionId":51,"RegionName":"Псковская область"},{"RegionId":52,"RegionName":"Республика Бурятия"},{"RegionId":53,"RegionName":"Красноярский край"},{"RegionId":54,"RegionName":"Забайкальский край"},{"RegionId":56,"RegionName":"Республика Калмыкия"},{"RegionId":57,"RegionName":"Республика Алтай"},{"RegionId":58,"RegionName":"Республика Тыва"},{"RegionId":61,"RegionName":"Амурская область"},{"RegionId":62,"RegionName":"Республика Дагестан"},{"RegionId":66,"RegionName":"Республика Марий Эл"},{"RegionId":67,"RegionName":"Республика Мордовия"},{"RegionId":68,"RegionName":"Удмуртская Республика"},{"RegionId":69,"RegionName":"Астраханская область"},{"RegionId":70,"RegionName":"Приморский край"},{"RegionId":71,"RegionName":"Республика Башкортостан"},{"RegionId":72,"RegionName":"Оренбургская область"},{"RegionId":73,"RegionName":"Тюменская область"},{"RegionId":75,"RegionName":"Ивановская область"},{"RegionId":76,"RegionName":"Ярославская область"},{"RegionId":77,"RegionName":"Костромская область"},{"RegionId":78,"RegionName":"Тульская область"},{"RegionId":80,"RegionName":"Пермский край"},{"RegionId":81,"RegionName":"Новосибирская область"},{"RegionId":84,"RegionName":"Республика Хакасия"},{"RegionId":85,"RegionName":"Алтайский край"},{"RegionId":86,"RegionName":"Нижегородская область"},{"RegionId":88,"RegionName":"Республика Саха (Якутия)"},{"RegionId":91,"RegionName":"Новгородская область"},{"RegionId":93,"RegionName":"Белгородская область"},{"RegionId":95,"RegionName":"Курская область"},{"RegionId":106,"RegionName":"Республика Крым"},{"RegionId":207,"RegionName":"Московская область"}]}}
    // ';
}

